app/controllers/problems_controller.rb

SELECT "problems".* FROM "problems" WHERE (problem_title like '%Binary%')  ORDER BY created_at DESC
---
	def index

		#Fetch all problems
		@problems = Problem.order(params[:sort])

SELECT  "problems".* FROM "problems" WHERE "problems"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		@problem = Problem.find(params[:id])