app/controllers/sessions_controller.rb

	def setting
		user = @current_user #logged in user

		if setting_params[:email].present?#email update
			user.update_attribute(:email, setting_params[:email])
---
UPDATE "users" SET "avatar_file_name" = $1, "avatar_file_size" = $2, "avatar_updated_at" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["avatar_file_name", "orc.jpg"], ["avatar_file_size", 90789], ["avatar_updated_at", "2015-11-28 18:05:32.074881"], ["updated_at", "2015-11-28 18:05:32.094195"], ["id", 57]]