app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "salt", "hashed_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
		@user = User.new(person_params)
		if @user.save